sangjun19/Deobfuscator/data/github_switch_codes/zhangdaiyan_my-allwinner-ics_linux-3.0_rtl8723au_led.c
// Repository: zhangdaiyan/my-allwinner-ics_linux-3.0
// File: drivers/net/wireless/rtl8723as/hal/rtl8723a/usb/rtl8723au_led.c

/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *                                        
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/

#include "drv_types.h"
//#include "rtl8192c_hal.h"
#include "rtl8723a_hal.h"

//================================================================================
//	Constant.
//================================================================================

//
// Default LED behavior.
//
#define LED_BLINK_NORMAL_INTERVAL	100
#define LED_BLINK_SLOWLY_INTERVAL	200
#define LED_BLINK_LONG_INTERVAL	400

#define LED_BLINK_NO_LINK_INTERVAL_ALPHA		1000
#define LED_BLINK_LINK_INTERVAL_ALPHA			500		//500
#define LED_BLINK_SCAN_INTERVAL_ALPHA		180 	//150
#define LED_BLINK_FASTER_INTERVAL_ALPHA		50
#define LED_BLINK_WPS_SUCESS_INTERVAL_ALPHA	5000

//================================================================================
// LED object.
//================================================================================


//================================================================================
//	Prototype of protected function.
//================================================================================


static void
BlinkTimerCallback(
	unsigned long data
	);

static void
BlinkWorkItemCallback(
	struct work_struct *work
	);

//================================================================================
// LED_819xUsb routines. 
//================================================================================

//
//	Description:
//		Initialize an LED_871x object.
//
static void
InitLed871x(
	_adapter			*padapter,
	PLED_871x		pLed,
	LED_PIN_871x	LedPin
	)
{
	pLed->padapter = padapter;

	pLed->LedPin = LedPin;

	pLed->CurrLedState = LED_OFF;
	pLed->bLedOn = _FALSE;

	pLed->bLedBlinkInProgress = _FALSE;
	pLed->BlinkTimes = 0;
	pLed->BlinkingLedState = LED_UNKNOWN;

	_init_timer(&(pLed->BlinkTimer), padapter->pnetdev, BlinkTimerCallback, pLed);

	_init_workitem(&(pLed->BlinkWorkItem), BlinkWorkItemCallback, pLed);
}


//
//	Description:
//		DeInitialize an LED_871x object.
//
static void
DeInitLed871x(
	PLED_871x			pLed
	)
{
	_cancel_timer_ex(&(pLed->BlinkTimer));

	// We should reset bLedBlinkInProgress if we cancel the LedControlTimer, 2005.03.10, by rcnjko.
	pLed->bLedBlinkInProgress = _FALSE;
}

//
//	Description:
//		Reset blinking status of LED_871x object.
//
static void
ResetLedStatus(PLED_871x	pLed) {
	pLed->CurrLedState = LED_OFF; // Current LED state.
	pLed->bLedOn = _FALSE; // true if LED is ON, false if LED is OFF.
	
	pLed->bLedBlinkInProgress = _FALSE; // true if it is blinking, false o.w..
	pLed->bLedNoLinkBlinkInProgress = _FALSE;
	pLed->bLedLinkBlinkInProgress = _FALSE;
	pLed->bLedStartToLinkBlinkInProgress = _FALSE;
	pLed->bLedScanBlinkInProgress = _FALSE;
	pLed->bLedWPSBlinkInProgress = _FALSE;
	pLed->BlinkTimes = 0; // Number of times to toggle led state for blinking.
	pLed->BlinkingLedState = LED_OFF; // Next state for blinking, either LED_ON or LED_OFF are.
}

//
//	Description:
//		Turn on LED according to LedPin specified.
//
static void
SwLedOn(
	_adapter			*padapter, 
	PLED_871x		pLed
)
{
	u8	LedCfg;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);

	if( (padapter->bSurpriseRemoved == _TRUE) || ( padapter->bDriverStopped == _TRUE))
	{
		return;
	}

	if( 	(BOARD_MINICARD == pHalData->BoardType )||
		(BOARD_USB_SOLO == pHalData->BoardType)||
		(BOARD_USB_COMBO == pHalData->BoardType))
	{
		LedCfg = rtw_read8(padapter, REG_LEDCFG2);
		switch(pLed->LedPin)
		{	
			case LED_PIN_GPIO0:
				break;

			case LED_PIN_LED0:
				rtw_write8(padapter, REG_LEDCFG2, (LedCfg&0xf0)|BIT5|BIT6); // SW control led0 on.
				break;

			case LED_PIN_LED1:
				rtw_write8(padapter, REG_LEDCFG2, (LedCfg&0x0f)|BIT5); // SW control led1 on.
				break;

			default:
				break;
	
		}
	}
	else
	{	
		switch(pLed->LedPin)
		{
			case LED_PIN_GPIO0:
				break;

			case LED_PIN_LED0:
#ifdef CONFIG_SW_ANTENNA_DIVERSITY
				if(pHalData->AntDivCfg)
				{
					LedCfg = rtw_read8(padapter, REG_LEDCFG2);
					rtw_write8(padapter, REG_LEDCFG2, (LedCfg&0xe0)|BIT7|BIT6|BIT5); // SW control led0 on.
					//RT_TRACE(COMP_LED, DBG_LOUD, ("SwLedOn LED0 0x%x\n", PlatformEFIORead4Byte(Adapter, REG_LEDCFG2)));
				}
				else
#endif
				{
					LedCfg = rtw_read8(padapter, REG_LEDCFG0);
					rtw_write8(padapter,REG_LEDCFG0, LedCfg&0x70); // SW control led0 on.
					//RT_TRACE(COMP_LED, DBG_LOUD, ("SwLedOn LED0 0x%lx\n", PlatformEFIORead4Byte(Adapter, REG_LEDCFG0)));
				}
				break;

			case LED_PIN_LED1:
				LedCfg = rtw_read8(padapter,(REG_LEDCFG1));
				rtw_write8(padapter,(REG_LEDCFG1), LedCfg&0x70); // SW control led1 on.
				//RT_TRACE(COMP_LED, DBG_LOUD, ("SwLedOn LED1 0x%lx\n", PlatformEFIORead4Byte(Adapter, REG_LEDCFG0)));
			
				break;

			default:
				break;
		}
	}
	pLed->bLedOn = _TRUE;
	
}


//
//	Description:
//		Turn off LED according to LedPin specified.
//
static void
SwLedOff(
	_adapter			*padapter, 
	PLED_871x		pLed
)
{
	u8	LedCfg;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);

	if((padapter->bSurpriseRemoved == _TRUE) || ( padapter->bDriverStopped == _TRUE))	
	{
		goto exit;
	}

	if( 	(BOARD_MINICARD == pHalData->BoardType )||
		(BOARD_USB_SOLO == pHalData->BoardType)||
		(BOARD_USB_COMBO == pHalData->BoardType))
	{
		LedCfg = rtw_read8(padapter, REG_LEDCFG2);//0x4E

		switch(pLed->LedPin)
		{

			case LED_PIN_GPIO0:
				break;

			case LED_PIN_LED0:
				if(BOARD_USB_COMBO == pHalData->BoardType)
				{
					LedCfg &= 0x90; // Set to software control.				
					rtw_write8(padapter, REG_LEDCFG2, (LedCfg|BIT3));				
					LedCfg = rtw_read8(padapter, REG_MAC_PINMUX_CFG);
					LedCfg &= 0xFE;
					rtw_write8(padapter, REG_MAC_PINMUX_CFG, LedCfg);									
				}
				else
				{
					LedCfg &= 0xf0; // Set to software control.
					if(pHalData->bLedOpenDrain == _TRUE) // Open-drain arrangement for controlling the LED
						rtw_write8(padapter, REG_LEDCFG2, (LedCfg|BIT1|BIT5|BIT6));
					else
						rtw_write8(padapter, REG_LEDCFG2, (LedCfg|BIT3|BIT5|BIT6));
				}
				break;

